{
    "0001": {
        "name": "Bulbasaur",
        "type": ["Grass", "Poison"],
        "description": "Bulbasaur is a small, mainly turquoise amphibian Pokémon with red eyes and a green bulb on its back. It is based on a frog/toad, with the bulb resembling a plant bulb that grows into a flower as it evolves.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "A strange seed was planted on its back at birth. The plant sprouts and grows with this Pokémon."
            }
        ],
        "sprites": ["BulbasaurSprite.png", "BulbasaurShinySprite.png"],
        "next_evolution": "0002"
    },
    "0002": {
        "name": "Ivysaur",
        "type": ["Grass", "Poison"],
        "description": "Ivysaur is a quadruped Pokémon that has blue-green skin with darker blue-green spots. It has red eyes and pointed, ear-like structures on top of its head. A large pink flower bud is on its back, which grows from the bulb that was planted at birth.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "When the bulb on its back grows large, it appears to lose the ability to stand on its hind legs."
            }
        ],
        "sprites": ["IvysaurSprite.png", "IvysaurShinySprite.png"],
        "next_evolution": "0003"
    },
    "0003": {
        "name": "Venusaur",
        "type": ["Grass", "Poison"],
        "description": "Venusaur is a large, quadruped Pokémon that resembles a dinosaur and a toad. It has blue-green skin with darker blue-green spots. A large pink flower with white petals blooms on its back, supported by a thick brown trunk and large green leaves.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "The plant blooms when it is absorbing solar energy. It stays on the move to seek sunlight."
            }
        ],
        "sprites": ["VenusaurSprite.png", "VenusaurShinySprite.png"],
        "next_evolution": null
    },
    "0004": {
        "name": "Charmander",
        "type": ["Fire"],
        "description": "Charmander is a bipedal, reptilian Pokémon with a primarily orange body and blue eyes. It has a long tail with a flame burning at the tip. The flame's size and intensity reflect Charmander's health and emotions.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "Obviously prefers hot places. When it rains, steam is said to spout from the tip of its tail."
            }
        ],
        "sprites": ["CharmanderSprite.png", "CharmanderShinySprite.png"],
        "next_evolution": "0005"
    },
    "0005": {
        "name": "Charmeleon",
        "type": ["Fire"],
        "description": "Charmeleon is a bipedal, reptilian Pokémon with a primarily orange body and blue eyes. It has a long tail with a flame burning at the tip. Charmeleon has a more aggressive appearance compared to its pre-evolved form, Charmander.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "When it swings its burning tail, it elevates the temperature to unbearably high levels."
            }
        ],
        "sprites": ["CharmeleonSprite.png", "CharmeleonShinySprite.png"],
        "next_evolution": "0006"
    },
    "0006": {
        "name": "Charizard",
        "type": ["Fire", "Flying"],
        "description": "Charizard is a large, dragon-like Pokémon that is primarily orange with a cream-colored underside. It has two powerful wings that allow it to fly, and its tail ends in a flame. Charizard is known for its fiery breath and aggressive nature.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "Spits fire that is hot enough to melt boulders. Known to cause forest fires unintentionally."
            }
        ],
        "sprites": ["CharizardSprite.png", "CharizardShinySprite.png"],
        "next_evolution": null
    },
    "0007": {
        "name": "Squirtle",
        "type": ["Water"],
        "description": "Squirtle is a small, turtle-like Pokémon with a blue body and a distinctive shell. It has small, round eyes and short legs. When it feels threatened, it withdraws into its shell.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "After birth, its back swells and hardens into a shell. Powerfully sprays foam from its mouth."
            }
        ],
        "sprites": ["SquirtleSprite.png", "SquirtleShinySprite.png"],
        "next_evolution": "0008"
    },
    "0008": {
        "name": "Wartortle",
        "type": ["Water"],
        "description": "Wartortle is a turtle-like Pokémon with a blue body and a brown shell. It has large, fluffy ears and a tail that resembles a wave. Wartortle is known for its agility in water and its ability to swim at high speeds.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "Often hides in water to stalk unwary prey. For swimming fast, it moves its ears to maintain balance."
            }
        ],
        "sprites": ["WartortleSprite.png", "WartortleShinySprite.png"],
        "next_evolution": "0009"
    },
    "0009": {
        "name": "Blastoise",
        "type": ["Water"],
        "description": "Blastoise is a large, bipedal turtle-like Pokémon with a blue body and a brown shell. It has two powerful water cannons protruding from its shell, which it uses to shoot water at high pressure. Blastoise is known for its strength and defensive capabilities.",
        "Pokédex entries": [
            {
                "game" : "Red/Blue",
                "entry": "A brutal Pokémon with pressurized water jets on its shell. They are used for high-speed tackles."
            }
        ],
        "sprites": ["BlastoiseSprite.png", "BlastoiseShinySprite.png"],
        "next_evolution": null
    }
}